# http://panda3d.org.ru/publ/2-1-0-2
# Импортирование ShowBase загружает большинство необходимых модулей панды и подготавливает
# окно к выводу изображения. Run - подпрограмма, содержащая главный цикл Panda3D.
# В ней отрисовывается кадр и выполняются фоновые задачи, после чего цикл повторяется.
# Эта подпрограмма должна быть вызвана единожды в конце вашего скрипта. В этом примере сцена
# не содержит данных для отрисовки, поэтому мы увидим пустое серое окно.
from direct.showbase.ShowBase import ShowBase


class MyApp(ShowBase):

    def __init__(self):
        ShowBase.__init__(self)


app = MyApp()
app.run()
